"%1$@ %2$@ has been downloaded and is ready to use! Would you like to install it and relaunch %1$@ now?" = "%1$@ %2$@ a fost descărcat și este gata de utilizare! Doriți să îl instalați și să-l relansați %1$@ acum?";

"%1$@ can't be updated when it's running from a read-only volume like a disk image or an optical drive. Move %1$@ to your Applications folder, relaunch it from there, and try again." = "%1$@ nu poate fii actualizată atunci când este pornită de pe un volum read-only ca o imagine disc sau o unitate optică. Mută %1$@ în directorul Applications, repornește-o de acolo și încearca din nou.";

"%@ %@ is currently the newest version available." = "%1$@ %2$@ este în prezent cea mai nouă versiune disponibilă.";

"%@ %@ is now available--you have %@. Would you like to download it now?" = "%1$@ %2$@ este disponibilă—-tu ai %3$@. Doriți să o descărcați acum?";

"%@ downloaded" = "%@ descărcat";

"%@ of %@" = "%1$@ din %2$@";

"A new version of %@ is available!" = "O nouă versiune %@ este disponibilă!";

"A new version of %@ is ready to install!" = "O nouă versiune %@ este gata de instalare!";

"An error occurred in retrieving update information. Please try again later." = "O eroare a avut loc în preluarea informaţiilor de actualizare. Vă rugăm să reîncercaţi mai târziu.";

"An error occurred while downloading the update. Please try again later." = "A apărut o eroare la descărcarea actualizării. Vă rugăm să reîncercaţi mai târziu.";

"An error occurred while extracting the archive. Please try again later." = "O eroare a avut loc în timpul dezarhivării arhivei. Vă rugăm să reîncercaţi mai târziu.";

"An error occurred while installing the update. Please try again later." = "A apărut o eroare la instalarea actualizării. Vă rugăm să reîncercaţi mai târziu.";

"An error occurred while parsing the update feed." = "A apărut o eroare la citirea feed-ului de actualizare.";

"An error occurred while relaunching %1$@, but the new version will be available next time you run %1$@." = "O eroare a avut loc în timpul relansării aplicației %1$@, dar noua versiune va fii disponibilă data viitoare când vei executa %1$@.";

/* the unit for bytes */
"B" = "B";

"Cancel" = "Anula";

"Cancel Update" = "Anulează actualizare";

"Checking for updates..." = "Verifică pentru actualizări…";

/* Take care not to overflow the status window. */
"Downloading update..." = "Descarcă actualizare…";

/* Take care not to overflow the status window. */
"Extracting update..." = "Dezarhivează actualizare…";

/* the unit for gigabytes */
"GB" = "GB";

"Install and Relaunch" = "Instalează și Relansează";

/* Take care not to overflow the status window. */
"Installing update..." = "Instalează actualizare…";

/* the unit for kilobytes */
"KB" = "KB";

/* the unit for megabytes */
"MB" = "MB";

/* OK button. */
"OK" = "OK";

/* Status message on progress window once download has finished. */
"Ready to Install" = "Pregatit pentru instalare";

/* Message that is optionally shown at startup to allow users to turn on/off update checks. */
"Should %1$@ automatically check for updates? You can always check for updates manually from the %1$@ menu." = "Ar trebui ca %1$@ să caute automat pentru actualizări? Puteți verifica mereu de actualizări din meniul %1$@.";

"Update Error!" = "Eroare actualizare!";

"Updating %@" = "Actualizează %@";

/* 'Error' message when the user checks for updates but is already current or the feed doesn't contain any updates. (not necessarily shown in UI) */
"You already have the newest version of %@." = "Aveți cea mai nouă versiune de %@.";

/* Status message shown when the user checks for updates but is already current or the feed doesn't contain any updates. */
"You're up-to-date!" = "Ai ultima versiune!";

/* Alternative name for "Install" button if we have a paid update or other update
	without a download but with a URL. */
"Learn More..." = "Află mai multe…";

